
## Plan Result (parser-graphql-wrapper-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/97299)


<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * local_file.application_ecs_service_appspec_94386B9C


<details><summary>Change Result (Click me)</summary>

```hcl

  # local_file.application_ecs_service_appspec_94386B9C will be created
  + resource "local_file" "application_ecs_service_appspec_94386B9C" {
      + content              = jsonencode(
            {
              + Resources = [
                  + {
                      + TargetService = {
                          + Properties = {
                              + LoadBalancerInfo = {
                                  + ContainerName = "app"
                                  + ContainerPort = 4001
                                }
                              + TaskDefinition   = "arn:aws:ecs:us-east-1:996905175585:task-definition/ParserGraphQLWrapper-Prod:775"
                            }
                          + Type       = "AWS::ECS::Service"
                        }
                    },
                ]
              + version   = 1
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobID":"8ae42346-0fcf-4bc1-b394-d5b6c3dc8bbc","JobName":"parser-graphql-wrapper_infrastructure_plan_prod","PRNumber":329,"Program":"tfcmt","SHA1":"63ab645f13cf50a53b56a8235344fc45f0b9c23b","Target":"parser-graphql-wrapper-cdk","Vars":{}} -->